Documents/Requests/Soap_Getcustomerdetails_mobile_23_02_2022_15_28_37_Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:vfd="http://amdocs/vfde/customer/VFDEGetCustomerDetails" xmlns:vfd1="http://amdocs/vfde/customer/VFDEGetCustomerDetailsInput">
    <soapenv:Header/>
    <soapenv:Body>
        <vfd:GetCustomerDetailsRequest>
            <vfd1:ROOT>
                <Event>
                    <Type>RetrieveCustomerInfo</Type>
                    <ID>4ea08a8e-c80c-4d93-b489-a1cfcad43b10</ID>
                    <CallerID>OSF</CallerID>
                    <CorrelationID>5522dd47-0e12-4b03-8dba-d04ca0c92ad6</CorrelationID>
                    <MessageCreationTimestamp>2022-02-23T05:31:24.817Z</MessageCreationTimestamp>
                </Event>
                <DATA>
                    <GlobalID>KS_</GlobalID>
                    <Mode>2</Mode>
                    <BANDetails>
                        <BAN></BAN>
                        <MarketCode>MMC</MarketCode>
                    </BANDetails>
                    <SourceSystemID> </SourceSystemID>
                    <Portal>{{portal}}</Portal>
                </DATA>
            </vfd1:ROOT>
        </vfd:GetCustomerDetailsRequest>
    </soapenv:Body>
</soapenv:Envelope>